Repository: IsaacHuo/MyLeafy
Catalog: leafy/Localizable.xcstrings
Source language: zh_hans
Languages: en_us

source: (本周)
en_us: (This week)

source: 上次更新：%@。
en_us: Last updated: %@.

source: 其他统计按有效课程计算：同名同学分课程会合并，补考或重修优先取已通过且分数最高记录；优秀、良好、中等等明确等级会映射为可解释的分值，通过制成绩只计通过与学分，不计入分数统计。
en_us: Other statistics are calculated based on valid courses: courses with the same name and student will be merged; for makeup or retake exams, the passed record with the highest score is prioritized; grades like excellent, good, medium, etc., will be mapped to interpretable scores; pass/fail system only counts pass and credits, not for score statistics.

source: ，正文前缀：%@
en_us: , body prefix: %@

source: “影响”按课程分数相对本地加权均分的偏离程度乘以学分排序，不是官方 GPA 预测。
en_us: "Impact" is ranked by the deviation of course scores from the locally weighted average multiplied by the credits, not an official GPA prediction.

source: （%@ %d-%d节）。
en_us: (%@ %d-%d periods).

source: %.1f 学分
en_us: %.1f Credits

# %@ · %arg
source: %1$@ · %2$arg
en_us: %@ · %arg

source: %@ · %d 条随记
en_us: %@ · %d note(s)

source: %@ · 学号 %@
en_us: %@ · Student ID %@

source: %@ · 距离上课 %@
en_us: %@ · Time until class %@

source: %@ · 距离下课 %@
en_us: %@ · Time until the end of class %@

source: %@ 今日视图
en_us: %@ Today's view

source: %@ 今日课表
en_us: %@ Today's Schedule

source: %@ 估算
en_us: %@ Estimate

source: %@ 共享课表邀请码已生成。
en_us: %@ Shared schedule invitation code has been generated.

# %@ 占用率 %lld%%
source: %1$@ 占用率 %2$lld%%
en_us: %@ occupancy rate %lld%%

source: %@ 学分
en_us: %@ Credit

source: %@ 学分待修
en_us: %@ credits pending

source: %@ 帮助中心
en_us: %@ Help Center

source: %@ 年 · %@
en_us: Year %@ · %@

source: %@ 年 1 月至 12 月
en_us: %@ January to December

source: %@ 年全年记录频率（%@）：%@
en_us: Year-round recording frequency for %@ (%@): %@

source: %@ 开始
en_us: %@ Start

source: %@ 成绩概览
en_us: %@ Score Overview

source: %@ 截止
en_us: %@ cut off

source: %@ 日程
en_us: %@ Agenda

source: %@ 日程视图
en_us: %@ Schedule view

source: %@ 更新
en_us: %@ Update

source: %@ 本周视图
en_us: %@ This week's view

source: %@ 的共享课表
en_us: %@’s shared class schedule

source: %@ 的社区申请正在审核，审核通过后会自动进入学校社区。
en_us: %@'s community application is under review. You will automatically enter the school community once it is approved.

source: %@ 社区
en_us: %@ Community

source: %@ 社区帖子：%@
en_us: %@ Community post: %@

source: %@ 社区条款
en_us: %@ Community Terms

source: %@ 社区条约
en_us: %@ Community Treaty

source: %@ 综素测算
en_us: %@ comprehensive factor calculation

source: %@ 超过 25 MB，无法导入。
en_us: %@ Exceeds 25 MB, cannot import.

source: %@ 邀请你查看 TA 的 %@ 课表。
en_us: %@ invites you to view TA's %@ schedule.

source: %@，%d 条随记
en_us: %@, %d note(s)

# %@，%lld 条随记
source: %1$@，%2$lld 条随记
en_us: %@, %lld notes

# %@，第 %lld 周%@%@
source: %1$@，第 %2$lld 周%3$@%4$@
en_us: %@, week %lld %@%@

source: %@：%d 条随记
en_us: %@: %d note(s)

source: %@今天开始
en_us: %@ Starts today

source: %@到%@
en_us: %@ to %@

source: %@前后体感温度约为 %d°，建议及时补水，减少长时间户外停留。
en_us: It will feel like about %2$d° around %1$@. Stay hydrated and avoid prolonged time outdoors.

source: %@前后体感温度约为 %d°，建议适当增加衣物。
en_us: It will feel like about %2$d° around %1$@. Consider wearing an extra layer.

source: %@学年
en_us: %@ school year

source: %@已开始
en_us: %@ Has started

source: %@添加日程
en_us: %@Add schedule

source: %@起
en_us: From %@

source: %@还有 %d 天
en_us: %@ There are %d days left

source: %@这一组还差 %d 次。
en_us: %@ needs %d more runs.

# %arg %arg
source: %1$arg %2$arg
en_us: %arg %arg

# %arg · %arg
source: %1$arg · %2$arg
en_us: %arg · %arg

# %arg · %arg · %arg
source: %1$arg · %2$arg · %3$arg
en_us: %arg · %arg · %arg

# %arg / %arg
source: %1$arg / %2$arg
en_us: %arg / %arg

# %arg %arg %arg
source: %1$arg %2$arg %3$arg
en_us: %arg %arg %arg

# %arg %arg-%arg
source: %1$arg %2$arg-%3$arg
en_us: %arg %arg-%arg

# %arg %arg，%arg
source: %1$arg %2$arg，%3$arg
en_us: %arg %arg，%arg

source: %arg 个
en_us: %arg Items

source: %arg 人参与
en_us: %arg Participants

source: %arg 人评分
en_us: %arg Ratings

# %arg 占用率 %arg%%
source: %1$arg 占用率 %2$arg%%
en_us: %arg Occupancy %arg%%

source: %arg 学分
en_us: %arg Credits

source: %arg 帮助中心
en_us: %arg Help Center

source: %arg 年
en_us: %arg Year

source: %arg 年 · MyLeafy
en_us: %arg Year · MyLeafy

source: %arg 年 1 月至 12 月
en_us: %arg From January to December

source: %arg 成绩概览
en_us: %arg Grade Overview

source: %arg 星
en_us: %arg Star

source: %arg 更新
en_us: %arg Update

# %arg 月 · %arg 条随记 · 记录 %arg 天
source: %1$arg 月 · %2$arg 条随记 · 记录 %3$arg 天
en_us: %arg Month · %arg Notes · Recorded %arg Days

source: %arg 本周视图
en_us: %arg Week View

source: %arg 条
en_us: %arg Items

# %arg 条 · %arg 天
source: %1$arg 条 · %2$arg 天
en_us: %arg Items · %arg Days

source: %arg 的共享课表
en_us: %arg Shared Schedule

source: %arg 社区条款
en_us: %arg Community Terms

source: %arg 社区条约
en_us: %arg Community Charter

source: %arg 票
en_us: %arg Ticket

source: %arg 综素测算
en_us: %arg Comprehensive Quality Measurement

# %arg 门课程 · %arg
source: %1$arg 门课程 · %2$arg
en_us: %arg Courses · %arg

# %arg 间占用 / %arg 间教室，%arg 间空闲
source: %1$arg 间占用 / %2$arg 间教室，%3$arg 间空闲
en_us: %arg Room Occupancy / %arg Classroom, %arg Free

# %arg-%arg %arg
source: %1$arg-%2$arg %3$arg
en_us: %arg-%arg %arg

# %arg，%arg
source: %1$arg，%2$arg
en_us: %arg，%arg

# %arg，%arg 条随记
source: %1$arg，%2$arg 条随记
en_us: %arg, %arg Note

# %arg，第 %arg 周%arg%arg
source: %1$arg，第 %2$arg 周%3$arg%4$arg
en_us: %arg, Week %arg %arg%arg

# %arg/%arg
source: %1$arg/%2$arg
en_us: %arg/%arg

# %arg%arg
source: %1$arg%2$arg
en_us: %arg%arg

# %arg%arg%arg
source: %1$arg%2$arg%3$arg
en_us: %arg%arg%arg

source: %arg学年
en_us: %arg Academic Year

source: %arg月
en_us: %arg Month

source: %arg添加日程
en_us: %arg Add Schedule

source: %d 个任务 / %d 条记录
en_us: %d Tasks / %d Records

source: %d 个提醒
en_us: %d Reminders

source: %d 个月
en_us: %d month(s)

source: %d 个空间 / %d 份资料
en_us: %d Spaces / %d Files

source: %d 分钟
en_us: %d Minutes

source: %d 分钟前提醒
en_us: %d Minutes Before Reminder

source: %d 分钟后上课，地点：%@
en_us: Class starts in %d minutes, location: %@

source: %d 分钟后有日程，地点：%@
en_us: Schedule in %d minutes, location: %@

source: %d 分钟后有日程：第 %d 节，地点：%@
en_us: Schedule in %d minutes: Period %d, location: %@

source: %d 分钟后有日程：第 %d 节。
en_us: Schedule in %d minutes: Period %d.

source: %d 分钟后有日程。
en_us: %d There Is a Schedule After Minutes.

source: %d 天
en_us: %d day(s)

source: %d 小时 %d 分钟
en_us: %d Hours %d Minutes

source: %d 月 · %d 条随记 · 记录 %d 天
en_us: %d month · %d note(s) · %d recording day(s)

source: %d 月 %d 条随记
en_us: %d: %d note(s)

source: %d 月记录 %d 天
en_us: %d: %d recording day(s)

source: %d 条 · %d 天
en_us: %d note(s) · %d day(s)

source: %d 条备注 / %d 个收藏
en_us: %d remark(s) / %d collection(s)

source: %d 条成绩
en_us: %d grade(s)

source: %d 条考试
en_us: %d exam(s)

source: %d 条要求
en_us: %d requirement(s)

source: %d 条记录
en_us: %d record(s)

source: %d 条随记
en_us: %d note(s)

source: %d 秒后重发
en_us: Resend in %d seconds

source: %d 级
en_us: %d level

source: %d 门
en_us: %d subject(s)

source: %d 门课
en_us: %d Courses

source: %d 门课程
en_us: %d course(s)

source: %d 门课程 · %@
en_us: %d course(s) · %@

source: %d 门课程 · 发布并生成邀请码
en_us: %d course(s) · Publish and generate invitation code

source: %d 门课程 · 生成邀请码前自动更新
en_us: %d course(s) · Automatically update before generating invitation code

source: %d月
en_us: %d

source: %lld 个
en_us: %lld

source: %lld 人参与
en_us: %lld people participated

source: %lld 人评分
en_us: %lld people rated

source: %lld 天截止
en_us: End of %lld days

source: %lld 年
en_us: %lld years

source: %lld 年 · MyLeafy
en_us: %lld years · MyLeafy

source: %lld 年 1 月至 12 月
en_us: %lld January to December

source: %lld 星
en_us: %lld star

# %lld 月 · %lld 条随记 · 记录 %lld 天
source: %1$lld 月 · %2$lld 条随记 · 记录 %3$lld 天
en_us: %lld months · %lld notes · Record %lld days

source: %lld 条
en_us: %lld items

# %lld 条 · %lld 天
source: %1$lld 条 · %2$lld 天
en_us: %lld bars · %lld days

source: %lld 票
en_us: %lld tickets

source: %lld 篇未发布内容
en_us: Unpublished content for %lld

# %lld 门课程 · %@
source: %1$lld 门课程 · %2$@
en_us: %lld courses · %@

source: %lld 门课程需要关注
en_us: %lld courses need attention

# %lld 间占用 / %lld 间教室，%lld 间空闲
source: %1$lld 间占用 / %2$lld 间教室，%3$lld 间空闲
en_us: %lld rooms are occupied / %lld classrooms are occupied, %lld rooms are free

source: %lld月
en_us: %lld month

source: 8 位邮箱验证码
en_us: 8-Digit Email Verification Code

source: 12 位共享课表邀请码
en_us: 12-Digit Shared Schedule Invitation Code

source: 12 位邀请码
en_us: 12-Digit Invitation Code

source: App 外观
en_us: App Icon

source: BJFU 教务已登录
en_us: BJFU academic affairs logged in

source: BJFU 教务未登录
en_us: BJFU academic affairs not logged in

# campus.sidebar.academics
source: 学校教学
en_us: Academics

# campus.sidebar.career
source: 职业规划
en_us: Career

# campus.sidebar.explore
source: 周末去哪
en_us: Explore

# campus.sidebar.grad-school
source: 考研信息
en_us: Grad School

# campus.sidebar.health
source: 医疗事项
en_us: Health

# campus.sidebar.ratings
source: 评价相关
en_us: Ratings

# campus.sidebar.spaces
source: 学习空间
en_us: Spaces

# campus.sidebar.sports
source: 体育相关
en_us: Sports

# campus.sidebar.study
source: 自习安排
en_us: Study

source: CSV 字段
en_us: CSV Fields

source: dayOfWeek 使用 1-7 表示周一到周日；weeks 和 duration 支持 1-16、1,3,5 这类写法。
en_us: dayOfWeek uses 1-7 to represent Monday to Sunday; weeks and duration support formats like 1-16, 1,3,5.

source: GPA 只使用学校官方数据；没有解析到官方值时不展示 GPA。
en_us: GPA Uses Only Official School Data; GPA Will Not Be Displayed if Official Values Are Not Parsed.

source: HTTP: %@，URL: %@，调试文件: %@
en_us: HTTP: %@, URL: %@, debug file: %@

source: HTTP: %@，URL: %@。请确认校园网连接，或刷新验证码后重试。
en_us: HTTP: %@, URL: %@. Please check the campus network connection, or refresh the captcha and try again.

source: Markdown 正文
en_us: Markdown body

source: PDF、Word 和图片会导入到本机私有目录，不会上传到云端。
en_us: PDF, Word, and Images Will Be Imported into the Local Private Directory and Will Not Be Uploaded to the Cloud.

source: QQ群反馈群
en_us: QQ Group Feedback Group

source: term 可写学期，credit 和 score 按学校原表填写；type 可写必修、选修、通识等分类。
en_us: term can write the semester, credit and score should be filled in according to the school's original table; type can write compulsory, elective, general education, etc.

# timetable.weekday.fri
source: 周五
en_us: Fri.

# timetable.weekday.mon
source: 周一
en_us: Mon.

# timetable.weekday.sat
source: 周六
en_us: Sat.

# timetable.weekday.sun
source: 周日
en_us: Sun.

# timetable.weekday.thurs
source: 周四
en_us: Thurs.

# timetable.weekday.tues
source: 周二
en_us: Tues.

# timetable.weekday.wed
source: 周三
en_us: Wed.

source: URL: %@，标题: %@%@%@
en_us: URL: %@, title: %@%@%@

source: 一条随记最多添加 %d 个附件。
en_us: A memo can contain up to %d attachments.

source: 一条随记最多添加 %d 张图片。
en_us: A memo can contain up to %d images.

source: 一级标题
en_us: Level 1 Heading

source: 三教 105
en_us: Three Religions 105

source: 三级标题
en_us: Level 3 Heading

source: 上一周
en_us: Last Week

source: 上一年
en_us: Last Year

source: 上午
en_us: Morning

source: 上次更新 %@
en_us: Last updated %@

source: 上次更新 %arg
en_us: Last Update %arg

source: 上次更新没有返回可用于计算拥挤度的教室。
en_us: The last update did not return classrooms available for calculating congestion.

source: 上课周次
en_us: Class Weeks

source: 上课日期
en_us: Class Dates

source: 上课节次
en_us: Class Periods

source: 上课节次与时间
en_us: Class sessions and times

source: 下一周
en_us: Next Week

source: 下一年
en_us: Next Year

source: 下一节：%@
en_us: Next Period: %@

source: 下午
en_us: Afternoon

source: 不同意时社区内容和互动会被条款门禁拦截。
en_us: If you disagree, community content and interactions will be blocked by the terms gate.

source: 不在课表节次内
en_us: Not within timetable sessions

source: 不提醒
en_us: No reminder

source: 不能点赞自己的帖子
en_us: Cannot like your own post

source: 与前 30 天的随记数量相同。
en_us: The note count matches the previous 30 days.

source: 专业
en_us: Major

source: 专业培养方案
en_us: Major Curriculum Plan

source: 专注记录
en_us: Focus Records

source: 专注记录仅保存在当前设备。
en_us: Focused records are only saved on the current device.

source: 专注进行中
en_us: Focus on progress

source: 专选课
en_us: Elective Course

source: 个人主页
en_us: Personal Homepage

source: 个人台账均只保存在本机，MyLeafy 只做资料收集并提供参考，不上传医疗数据，也不会实时更新政策。
en_us: Personal records are only stored on this device. MyLeafy only collects information and provides reference; it does not upload medical data, nor does it update policies in real time.

source: 个人备注
en_us: Personal Notes

source: 个人简历
en_us: Resume

source: 个性化
en_us: Personalization

source: 为了避免误操作，这里的添加、导入和清空操作已关闭。
en_us: To avoid misoperation, add, import, and clear operations here have been disabled.

source: 为确保数据安全，PDF 和图片只在本地保存文件路径和记录信息，不会传输到外界。
en_us: To ensure data security, PDF and images only save the file path and record information locally and will not be transmitted externally.

source: 主楼 412
en_us: Main Building 412

source: 主页背景
en_us: Homepage Background

source: 主题色
en_us: Theme Color

source: 主题色会用于 App 强调色、课程卡片和小组件外观。
en_us: The theme color will be used for the app's accent color, course cards, and widget appearance.

source: 举报
en_us: Report

source: 举报与反馈
en_us: Report and Feedback

source: 举报与反馈内容
en_us: Report and Feedback Content

source: 举报内容
en_us: Report Content

source: 举报后该内容会立即从你的页面移除，并进入 24 小时审核队列。
en_us: After reporting, the content will be immediately removed from your page and enter a 24-hour review queue.

source: 举报已提交。
en_us: Report Submitted.

source: 二教 203
en_us: Second Teaching 203

source: 二级标题
en_us: Secondary Title

source: 仅保存照片，不保存 PDF；图片会转换为本机私有目录中的 JPEG。
en_us: Only save photos, do not save PDFs; images will be converted into JPEG in the local private directory.

source: 仅导出当前身份下未移入回收站的本地随记；导出不会上传或删除原始内容。
en_us: Only export local notes under the current identity that have not been moved to the recycle bin; exporting will not upload or delete the original content.

source: 仅显示在今天所在周，颜色跟随主题色。
en_us: Only show in the current week, color follows the theme color.

source: 仅更改 MyLeafy 的显示语言，不会修改系统语言。
en_us: Changes only MyLeafy's display language, not the system language.

source: 仅本次课
en_us: Only This Class

source: 今天 %@
en_us: Today, %@

source: 今天已跑
en_us: Ran away today

source: 今天建议
en_us: Today's Suggestions

source: 今天截止
en_us: Deadline today

source: 今天没有课程
en_us: No Classes Today

source: 今天没有课程，注意考试安排
en_us: No Classes Today, Pay Attention to Exam Arrangements

source: 今天没有课程安排
en_us: No Class Schedule Today

source: 今日 %d 门课
en_us: Today's %d Class

source: 今日无课
en_us: No Classes Today

source: 今日暂无课程安排。
en_us: No Class Schedule for Today.

source: 今日视图
en_us: Today's View

source: 今日课程已结束
en_us: Today's Classes Have Ended

source: 今日课程较少。
en_us: Fewer Classes Today.

source: 今日课表
en_us: Today's Schedule

source: 代码
en_us: Code

source: 代码块
en_us: Code Block

source: 以获取社区最新内容
en_us: To access the latest community content

source: 任务名称
en_us: Task Name

source: 任务已不存在
en_us: Task no longer exists

source: 任务已保存。
en_us: Task Saved.

source: 任务已删除。
en_us: Task Deleted.

source: 任务已添加。
en_us: Task Added.

source: 优先回顾历年同日，再从旧随记中稳定选取。
en_us: Prioritize reviewing the same date from previous years, then reliably select from the old records.

source: 会显示在这门课的所有周次上。
en_us: Will appear on all weeks of this course.

source: 会清空当前通用入口本机课表、备注、提醒和相关缓存；不会影响北京林业大学入口。
en_us: will clear the current general entry local schedule, notes, reminders, and related cache; It will not affect the entrance to Beijing Forestry University.

source: 会清空当前通用入口本机课表、备注、提醒和相关缓存；不影响北京林业大学入口。
en_us: will clear the current general entry local class schedule, notes, reminders, and related caches; This does not affect the entrance to Beijing Forestry University.

source: 估算结果
en_us: Estimated results

source: 体感温度（°C）
en_us: Feels like (°C)

source: 体感温度趋势
en_us: Feels-like temperature

source: 体测记录
en_us: Physical test record

source: 体育相关
en_us: Sports

source: 作业、考试、分组或老师要求
en_us: Homework, exams, group assignments, or teacher requirements

source: 作息时间
en_us: Daily Schedule

source: 作者头像下载失败，请检查网络后重试。
en_us: Failed to Download Author Avatar, Please Check Your Network and Try Again.

source: 你最常在%@的%@记录。
en_us: You record most often on %@ during %@.

source: 你可以在这里查看社区规则，并重新选择是否同意。不同意后将不能进入社区、发帖或评论。
en_us: You can check the community rules here and reconsider whether to agree. If you disagree, you will not be allowed to enter the community, post, or comment.

source: 你将加入“%@”社区。之后如果要更换学校，需要在个人资料中提交审核。
en_us: You will join the %@ community. Future school changes require a review request from your profile.

source: 你将申请从“%@”更换到“%@”。审核通过前仍保留当前学校社区。
en_us: You will request a change from %@ to %@. Your current school community will remain until the request is approved.

source: 你将申请更换到“%@”。审核通过前不会改变当前学校社区。
en_us: You will request a change to %@. Your current school community will not change until the request is approved.

source: 使用
en_us: Use

source: 使用 Markdown 写下正文…
en_us: Use Markdown to write the main text...

source: 使用指南 / 常见问题 / 同步与数据安全
en_us: User Guide / FAQ / Synchronization and Data Security

source: 使用社区代表你同意遵守以下规则。%@ 对违规内容和滥用用户采取零容忍政策。
en_us: By using the Community you agree to abide by the following rules. %@ has a zero-tolerance policy against illegal content and abusive users.

source: 使用社区代表你同意遵守以下规则。%arg 对违规内容和滥用用户采取零容忍政策。
en_us: Using the community represents your agreement to comply with the following rules. %arg Adopt a zero-tolerance policy toward violating content and abusing users.

source: 使用系统外观设置
en_us: Use System Appearance Settings

source: 使用邮箱和密码登录通用入口账号。
en_us: Sign in to your general access account with your email and password.

source: 使用默认背景
en_us: Use Default Background

source: 例如：图书馆晚上哪里更安静？
en_us: For example: Where is the library quieter at night?

source: 例如：期末周图书馆开放到几点更合适？
en_us: For example: What time is it best for the library to be open during final week?

source: 保存
en_us: Save

source: 保存中
en_us: Saving

source: 保存中…
en_us: Saving…

source: 保存位置
en_us: Save Location

source: 保存到学习空间
en_us: Save to Learning Space

source: 保存后主页会使用默认背景。
en_us: After Saving, Homepage Will Use Default Background.

source: 保存后可以在“我的发帖”中的草稿箱继续编辑。
en_us: After saving, you can continue editing in the draft box under "My Posts."

source: 保存在当前校园身份的本机空间
en_us: Save in Local Space for Current Campus Identity

source: 保存在本机
en_us: Save on This Device

source: 保存备注
en_us: Save the notes

source: 保存失败
en_us: Save failed

source: 保存失败，请稍后重试。
en_us: Save Failed, Please Try Again Later.

source: 保存岗位、宣讲会、导师主页或申请入口。
en_us: Save the position, seminar, mentor homepage, or application portal.

source: 保存提醒设置
en_us: Save reminder settings

source: 保存的帖子会显示在这里。
en_us: Saved posts will be displayed here.

source: 保存结果
en_us: Save the result

source: 保存规则
en_us: Rules for saving

source: 保存资料后会恢复为内置默认背景。
en_us: After Saving Data, It Will Restore to Built-in Default Background.

source: 保存长图
en_us: Save long image

source: 保存随记
en_us: Save your notes

source: 修改账号或密码
en_us: Change account or password

source: 假期
en_us: Holiday

source: 停止共享
en_us: Stop sharing

source: 停止共享课表？
en_us: Stop sharing the timetable?

source: 停止后会写入当前学习空间的专注记录。
en_us: After stopping, the focus record of the current learning space will be written.

source: 停止并保存
en_us: Stop and save

source: 停止录音
en_us: Stop recording

source: 停止语音转写
en_us: Stop speech transcription

source: 先安装 EasyConnect，使用学校账号连接北林 VPN。连接成功后返回 MyLeafy，可使用需要校园网的教务功能。
en_us: First, install EasyConnect and use your school account to connect to Beilin VPN. After a successful connection, return to MyLeafy to use the academic affairs functions required by the campus network.

source: 先重新同步本机课表，再更新共享课表
en_us: First resynchronize the local schedule, then update the shared schedule

source: 全学期
en_us: Whole Semester

source: 全年记录频率
en_us: Year-round recording frequency

source: 全年频率
en_us: annual frequency

source: 全站通知
en_us: Site-wide notification

source: 全部分类
en_us: All categories

source: 全部地点
en_us: All locations

source: 全部学院
en_us: All colleges

source: 全部已读
en_us: All read

source: 全部星级
en_us: All star ratings

source: 全部本地记录
en_us: All local records

source: 全部照片
en_us: All photos

source: 全部随记
en_us: All notes on hand

source: 全部食堂
en_us: All cafeterias

source: 公开实名认证标记
en_us: Public Real-Name Authentication Badge

source: 公开帖子
en_us: public post

source: 公选课
en_us: General Elective Course

source: 公选课类别
en_us: Public Elective Course Categories

source: 共享操作
en_us: Shared Operation

source: 共享课表
en_us: Share Timetable

source: 共享课表已更新
en_us: Shared Schedule Updated

source: 共享课表已更新。
en_us: Shared Schedule Updated.

source: 共享课表已移除。
en_us: Shared Schedule Removed.

source: 关于 MyLeafy
en_us: About MyLeafy

source: 关闭
en_us: Close

source: 关闭后评论和点赞不会再生成新通知。
en_us: After closing, comments and likes will no longer generate new notifications.

source: 关闭照片选择
en_us: Close Photo Selection

source: 关闭运营 Banner
en_us: Close Operation Banner

source: 关闭通知
en_us: Close Notifications

source: 其他类别
en_us: Other Categories

source: 最低
en_us: Low

source: 最低体感温度 %@
en_us: Lowest feels-like temperature %@

source: 最终确认删除？
en_us: Confirm final deletion?

source: 最近 12 周
en_us: Last 12 weeks

source: 最近同步：%@
en_us: Last synchronized: %@

source: 最近记录
en_us: Recent records

source: 最长连续
en_us: Longest streak

source: 最长连续记录
en_us: Longest recording streak

source: 最高
en_us: High

source: 最高 / 最低
en_us: High / low

source: 写一句个人签名
en_us: Write a Personal Signature

source: 写下第一条随记后，这里会逐渐形成你的记录频率和习惯。
en_us: After writing your first casual note, your recording frequency and habits will gradually form here.

source: 写评论…
en_us: Write a comment…

source: 分享
en_us: Share

source: 分享于 %@
en_us: Shared on %@

source: 分享于 %arg
en_us: Shared to %arg

source: 分享今日课表
en_us: Share Today's Schedule

source: 分享全部体测记录
en_us: Share All Fitness Test Records

source: 分享图片生成失败，请稍后重试。
en_us: Failed to Generate Shared Image, Please Try Again Later.

source: 分享或用其他 App 打开
en_us: Share or Open with other App

source: 分享日程
en_us: Share Schedule

source: 分享本周课表
en_us: Share This Week's Timetable

source: 分享视图
en_us: Share View

source: 分享邀请码
en_us: Share Invitation Code

source: 分享链接
en_us: Share Link

source: 分享长图
en_us: Share Long Image

source: 分享预览
en_us: Share Preview

source: 分数段
en_us: Fractional segment

source: 分数段分布
en_us: Score Distribution

source: 分数线、招生计划或判断依据
en_us: Score Line, Enrollment Plan or Judgment Basis

source: 分类
en_us: Category

source: 分类置顶
en_us: Pin Category

source: 分钟：%arg
en_us: Minutes: %arg

source: 分钟：%lld
en_us: Minutes: %lld

source: 分隔线
en_us: Divider

source: 切换 MyLeafy 小组件显示今天或明天的课表。
en_us: Toggle the MyLeafy widget to display today's or tomorrow's class schedule.

source: 切换课表日期
en_us: Switch class schedule dates

source: 列表
en_us: List

source: 创建一条自定义推送提醒
en_us: Create a Custom Push Reminder

source: 删除
en_us: Delete

source: 删除 MyLeafy 账户
en_us: Delete MyLeafy account

source: 删除 MyLeafy 账户？
en_us: Delete MyLeafy Account?

source: 删除%@
en_us: Delete %@

source: 删除%arg
en_us: Delete %arg

source: 删除个人简历？
en_us: Delete Resume?

source: 删除任务
en_us: Delete Task

source: 删除后会同时移除本地文件，无法恢复。
en_us: Deleting will also remove local files and cannot be recovered.

source: 删除后会同时移除本地照片，无法恢复。
en_us: Deleting will also remove local photos and cannot be recovered.

source: 删除后会同时移除本地简历文件，无法恢复。
en_us: Deleting will also remove local resume files and cannot be recovered.

source: 删除后会立即更新当前通用入口的成绩分析，此操作不影响北京林业大学入口。
en_us: Deleting will immediately update the grade analysis of the current general entry; this operation does not affect the Beijing Forestry University entry.

source: 删除后无法恢复。完成后 App 会清除本机数据并返回登录页。
en_us: Deletion cannot be undone. After completion, the App will clear local data and return to the login page.

source: 删除备注
en_us: Delete Note

source: 删除失败
en_us: Deletion Failed

source: 删除学习空间
en_us: Delete Study Space

source: 删除审核中
en_us: Deletion Under Review

source: 删除待审核
en_us: Deletion pending review

source: 删除成绩
en_us: Delete Grades

source: 删除申请审核中
en_us: Delete Application Under Review

source: 删除申请已提交。
en_us: Delete Request Submitted.
